# ChangeToReferenceLine Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelCurve..::..ChangeToReferenceLine Method
ModelCurve Class See Also
---
Changes this curve to a reference curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void ChangeToReferenceLine()
```

Visual Basic
---
```text
Public Sub ChangeToReferenceLine
```

Visual C++
---
```text
public:
void ChangeToReferenceLine()
```

# See Also
ModelCurve Class
Autodesk.Revit.DB Namespace